n=int(input("Въведете вид на фигурата: "))
def area(n):
    if n==1: 
        a=int(input("Въведете страни на квадрата: "))
        return a*a
    elif n==2: 
        a=int(input("Въведете страна на правоъгълника: "))
        b=int(input("Въведете страна на правоъгълника: "))
        return a*b
    elif n==3: 
        a=int(input("Въведете страна на триъгълника: "))
        b=int(input("Въведете страна на триъгълника: "))
        c=int(input("Въведете страна на триъгълника: "))
        return (a*b)/2 
print("Лицето на геометричната фигура е: ",area(n))